defmodule ElixirCource.ListExercise do
  @moduledoc """
  Модуль для практики по работе со списками.
  При выполнении задач запрещено использовать модули List и Enum
  """

  @doc """
    Заменить все положительные элементы целочисленного списка на максимальное значение
    элементов списка.
    :param input_list: Исходный список
    :return: Список с замененными элементами
  """
  def replace(input_list) do
    :skip
  end

  @doc """
    Реализовать двоичный поиск
    Функция должна возвращать индекс элемента
    Если элемента нет в списке, функция должна возвращать -1
    :param input_list: Исходный список
    :param query: Искомый элемент
    :return: Номер элемента
  """
  def search(input_list, query) do
    :skip
  end
end
